blog/cluedo-csp-javascript/cluedo-con-javascript.tex
% Created 2017-09-02 sáb 17:50
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{alvaro}
\date{2017-08-29 mar}
\title{El Cluedo como problema de lógica de segundo orden}
\hypersetup{
 pdfauthor={alvaro},
 pdftitle={El Cluedo como problema de lógica de segundo orden},
 pdfkeywords={AI,programación,javascript},
 pdfsubject={El Cluedo es considerado un juego para niños, pero bajo su superficie hay un interesante problema de lógica de segundo orden.},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.10)}, 
 pdflang={English}}
\begin{document}

\maketitle
El Cluedo es un juego infantil cuyas normas pueden resumirse en las siguientes:
\begin{itemize}
\item Las cartas tienen tres categorías: \textbf{personajes}, \textbf{herramientas} y \textbf{lugar}.
\item Se oculta una carta de cada tipo en un sobre.
\item El resto de cartas se reparte entre los jugadores
\item Los jugadores deben deducir qué cartas están ocultas mediante sus preguntas.
\item En cada turno, un jugador hace una \emph{predicción} de tres cartas
\begin{itemize}
\item El jugador a su derecha debe mostrar una de esas cartas al jugador que ha preguntado (si es poseedor de ellas).
\item Si no posee ninguna, debe admitirlo y se hace la misma pregunta al siguiente jugador, hasta que algún jugador muestra una carta, o se llega de nuevo al jugador que hizo la pregunta.
\end{itemize}
\item Cuando un jugador crea tener la combinación oculta en el sobre, debe hacer una \emph{acusación}, diciendo en alto esas tres cartas.
\begin{itemize}
\item Comprobará él mismo si ha acertado con las tres cartas, en cuyo caso ha ganado el juego.
\item Si no ha acertado, seguirá jugando, pero sin la posibilidad de ganar.
\end{itemize}
\item En las normas completas del juego se utilizan también dados y fichas sobre un tablero, pero esas normas no son importantes para el problema de lógica.
\end{itemize}


Con el material del juego se incluyen unas plantillas de ayuda a los jugadores, donde hay una casilla por cada posible carta. En las instrucciones se indica que se debe apuntar cada carta que se posea, o que se descubra mediante preguntas que otros jugadores tienen. Al final, las tres cartas que queden sin apuntar serán las cartas ocultas. 

Aunque este enfoque es correcto, es mejorable utilizando el resto de información disponible para cada jugador. Como se verá posteriormente, cada respuesta a una pregunta puede representarse como una fórmula lógica de primer orden, permite realizar muchas más deducciones.

\section*{Variables lógicas}
\label{sec:org7425dda}
Supongamos que hay \(J\) jugadores, \(P\) cartas de personaje, \(H\) cartas de herramientas y \(L\) cartas de lugar. En total habrá \(M=J+P+H\) cartas. El sobre puede considerarse un jugador más (por ejemplo, el número \(0\)). Para cada carta y jugador tendremos en cuenta una variable que indica si ese jugador posee esa carta, \(c_{ij}\), con los subíndices variando entre los posibles valores de jugadores y cartas (\(i \in M, j \in J\)).

En el resto de la discusión, supondremos que el valor lógico \(verdadero\) equivale a \(1\) al utilizarse con operadores numéricos, y que \(falso\) equivale a \(0\).

La estructura del problema impone varias condiciones sobre las variables \(c_{ij}\):
\begin{itemize}
\item Si un jugador posee una carta, el resto de jugadores no pueden tenerla: \({\sum_{j} c_{ij} = 1}, \forall i \in M\)
\item Cada jugador tiene un número de cartas \(n_j\), por lo que \(\sum_{i} c_{ij} = n_j\). Por ejemplo, en el sobre (jugador \(0\)) siembre hay tres cartas, por lo que \(\sum_{i} c_{i0} = 3\).
\item En el sobre hay una carta de cada tipo. Por tanto \(\sum_{i \in J} c_{i0} = 1}\), \(\sum_{i \in P} c_{i0} = 1}\), \(\sum_{i \in L} c_{i0} = 1}\)
\item Si el jugador \(j\) nos muestra la carta \(i\), podemos asignar el valor \(c_{ij}=true\).
\item Si el jugador \(j\) reconoce no tener ninguna de las cartas \(x,y,z\) podemos asignar los valores \(c_{xj}=false\) ,  \(c_{yj}=false\) ,  \(c_{zj}=false\)
\item Si el jugador \(j\) reconoce tener alguna de las cartas \(x,y,z\) a otro jugador, podemos deducir que \((c_{xj} \lor c_{yj} \lor c_{zj}) = true\)
\item Si un jugador hace una \emph{acusación} con cartas \(x,y,z\), pero no acierta, podemos deducir que \(\lnot(c_{x0} \land c_{y0} \land c_{z0}) = true\).
\end{itemize}


Puede verse que cada una de estas ecuaciones es una \textbf{restricción} que deben cumplir las variables \(c_{ij}\). Las restricciones impiden que todos los valores sean válidos.

\section*{Expresiones lógicas}
\label{sec:org6cf409c}
En el punto anterior, se vio que puede modelarse el problema utilizando las funciones lógicas \(\lnot\) (negación), \(\land\) (conjunción), \(\lor\) (disyunción), y una función que cuente si el número de variables con valor \(true\) es un número determinado \(n\), que llamaremos \(V_n()\).

De estas funciones, sólo \(\lnot\) y \(V_n()\) son primitivas:
\begin{itemize}
\item \(a \land b\) puede expresarse como \(V_2(a,b)\)
\item \(a \lor b\) puede expresarse como \(\lnot( \lnot a \land \lnot b)\) (leyes de Morgan)
\end{itemize}

\section*{Programación por restricciones}
\label{sec:org7016a35}
La programación por restricciones es una técnica para dar valores a variables de una forma coherente con las restricciones impuestas entre ellas.

Los elementos de un sistema de programación por restricciones son:
\begin{itemize}
\item Las variables (nuestras \(c_{ij}\))
\item Las restricciones entre ellas
\item Una forma de \textbf{propagar} las restricciones: aplicar las consecuencias de los valores de variables y restricciones en los posibles valores de otras variables
\item Un sistema de \textbf{prueba y error}: cuando la propagación no es suficiente para dar valor a todas las variables, se realiza una búsqueda entre los posibles valores hasta encontrar un conjunto coherente.
\end{itemize}

\subsection*{Variables}
\label{sec:org34ec55b}
Las variables tienen un dominio inicial, que es el conjunto de sus valores posibles. Como son variables lógicas, este dominio es \(\{true,false\}\). Es importante señalar que durante la propagación y la búsqueda este dominio nunca se amplía, sino que se reduce. 

Si una variable tiene solo un valor en su dominio, se considera que ese es su valor, y la variable está \textbf{definida}.

Si alguna variable llega a tener un dominio sin posibles valores (dominio vacío), es porque dicha variable no puede tener ningún valor posible, por lo que las restricciones y los dominios de las demás variables no son coherentes.

\subsection*{Expresiones}
\label{sec:orgbce83ed}
Las expresiones pueden verse también como variables. Por ejemplo, si el dominio de \(a\) y \(b\) es \(\{true,false\}\), \(a \land b\) tiene el mismo dominio. Pero si el dominio de \(b\) se reduce a \(\{false\}\), el dominio de \(a \land b\) también se reduce (ya no puede ser \(true\)). Esto hace que una \emph{expresión} pueda utilizarse como una variable más.

\subsection*{Restricciones}
\label{sec:org82d7426}
Una restricción es una expresión a la que se fija un valor. Por ejemplo, \(a \land b\) es una expresión, pero \(a \land b = false\) se convierte en una restricción.


\subsection*{Propagación}
\label{sec:org9c4e729}
En la propagación se extraen consecuencias de las expresiones y los dominios de variables. Basta con estudiar \(\lnot\) y \(V_n()\), puesto que las demás pueden basarse en estas.

Pueden distinguirse dos direcciones en la propagación: desde los elementos de una expresión hacia la expresión (hacia \emph{arriba}), y desde la expresión hacia sus elementos (hacia \emph{abajo})

\subsubsection*{Propagación hacia \emph{arriba}}
\label{sec:org4a69321}
\begin{itemize}
\item Si se elimina \(true\) de \(a\), puede eliminarse \(false\) de \(\lnot a\).
\item Si se elimina \(false\) de  \(a\), puede eliminarse \(true\) de \(\lnot a\).
\item Para \(V_n(a_1,a_2,\ldots,a_m)\)
\begin{itemize}
\item Si hay más de \(n\) variables definidas a \(true\), la expresión es \(false\) (se elimina \(true\) del dominio de la expresión)
\item Si hay más de \(m-n\) variables definidas a \(false\), la expresión es \(false\) (se elimina \(true\) del dominio de la expresión)
\item Si están definidas todas las variables y hay \(n\) a \(true\), se elimina \(false\) del dominio de la expresión.
\end{itemize}
\end{itemize}


\subsubsection*{Propagación hacia \emph{abajo}}
\label{sec:orgbc3c64b}
\begin{itemize}
\item Si se elimina \(true\) de \(\lnot a\), puede eliminarse \(false\) de \(a\).
\item Si se elimina \(false\) de  \(\lnot a\), puede eliminarse \(true\) de \(a\).
\item Si \(V_n(a_1,a_2,\ldots,a_m)\) es \(false\) y todas las variables están definidas menos \(a_i\)
\begin{itemize}
\item Si hay \(n-1\) variables \(true\), entonces \(a_i\) es \(false\) (se le quita \(true\))
\item Si hay n variables a \(true\), entonces \(a_i\) es \(true\) (se le quita \(false\))
\end{itemize}
\item Si \(V_n(a_1,a_2,\ldots,a_m)\) es \(true\) y todas las variables están definidas menos \(l\) de ellas:
\begin{itemize}
\item Si hay \(n\) variables \(true\), entonces todas las \(l\) variables sin definir son \(false\) (se les quita \(true\))
\item Si hay \(n-l\) variables a \(true\), entonces todas las \(l\) variables son \(true\) (se les quita \(false\))
\end{itemize}
\end{itemize}


\textbf{*}
\end{document}